{
  "description": "Feature backlog — www.jodieplant.com (ref: docs/WEBSITE_BRIEF.md v2.3)",
  "items": [
    {
      "id": "FEAT-017",
      "title": "Add individual service sub-pages",
      "description": "Create 9 individual service pages per brief Appendix C (v2.0): /services/search-ai-visibility, /services/ai-marketing-systems, /services/authority-content, /services/smart-stack-paid-media, /services/social-media, /services/local-visibility, /services/email-marketing, /services/conversion-optimization, /services/growth-attribution. Each: hero, AI-enhanced approach for this service, deliverables, FAQ (3-5 questions), CTA. Targets long-tail search queries. Service names use outcome-first language per external strategy review.",
      "acceptanceCriteria": [
        "8 service sub-pages exist under /services/",
        "Each leads with the AI-enhanced approach specific to that service",
        "Each has FAQ section targeting service-specific search queries",
        "Navigation updated to support service sub-pages",
        "All pages responsive with brand styling"
      ],
      "priority": "could",
      "readyForSprint": false,
      "dependsOn": [
        "FEAT-005"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "RE-GROOMED (2026-02-24): Phase 2 now complete — blog, guides (4 pages), analytics, chat, and calendar all live. Service sub-pages are still Phase 3 — good for long-tail SEO but not conversion-blocking. Sprint after entity authority (FEAT-035) and testimonials (FEAT-046) are established — individual service pages work best when there is social proof and domain authority behind them. Each page should target a specific service keyword (e.g. 'fractional CMO for startups', 'AI-powered SEO agency'). Estimated: Q2 2026."
    },
    {
      "id": "FEAT-018",
      "title": "Add individual case study pages (when real content exists)",
      "description": "Create /results/[slug] case study pages per brief Appendix C (v2.0). ONLY when real case study content is available — never with fabricated content. Structure: client context, strategy, execution, real metrics, testimonial, CTA. Link from /results project cards.",
      "acceptanceCriteria": [
        "Case study pages exist with real client content only",
        "Each follows structure: context, strategy, execution, results, quote, CTA",
        "Results include specific, real metrics",
        "Linked from /results page",
        "Responsive with brand styling"
      ],
      "priority": "future",
      "readyForSprint": false,
      "dependsOn": [
        "FEAT-006"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "RE-GROOMED (2026-02-24): Future track — explicitly blocked until real case studies exist. Never fabricate. The current /results page (real credentials + methodology walkthroughs + outcome range anchors) is more credible than empty case study shells. This item becomes relevant after 3–6 months of active client engagements. When real results exist: one detailed case study is worth ten vague portfolio logos. Estimated: Q3–Q4 2026."
    },
    {
      "id": "FEAT-019",
      "title": "Add email capture / newsletter signup with lead magnet",
      "description": "Add email capture per brief Section 11 Phase 2. Offer value exchange — downloadable 'Startup Marketing Checklist' PDF or similar. Use ConvertKit or Resend free tier. Add to blog posts and optionally homepage. Double opt-in, GDPR compliant.",
      "acceptanceCriteria": [
        "Email signup form on blog posts and/or homepage",
        "Lead magnet (checklist PDF or similar) delivered on signup",
        "Double opt-in flow",
        "Privacy notice near form",
        "Confirmation message on submission"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "ELEVATED TO SHOULD: Blog (3 posts) and guides (4 pages) are live — the infrastructure to drive email subscribers now exists. Email capture converts readers who aren't ready to book a call. LEAD MAGNET RECOMMENDATION: A 1-page PDF 'Startup Marketing Playbook' — curated summary of the 4 guide pages (Fractional CMO comparison, Alternatives to Ads, Marketing Costs, What a Retainer Includes) as a downloadable quick-reference. Lightweight to create, high alignment with existing guide content. Natural placement: at the end of each blog post and each guide page. Use ConvertKit free tier (up to 10K subscribers). BLOCKER: Lead magnet PDF must exist before Tech Lead marks readyForSprint. Create PDF first, then sprint the form integration."
    },
    {
      "id": "FEAT-024",
      "title": "Add PostHog blog content engagement tracking",
      "description": "When blog exists (FEAT-013), add content-specific PostHog events per brief Section 11 'Custom Events — Content Engagement'.\n\nEvents:\n- blog_post_read: fires when user scrolls past 75% of post body. Properties: post_slug, post_title, read_time_seconds (time from page load to 75% scroll)\n- external_link_clicked: fires on any outbound link click from blog posts. Properties: url, link_text, page\n\nAlso add blog CTA tracking — when the end-of-post 'Get your free audit' CTA is clicked, fire cta_clicked with cta_location = 'blog_post' and post_slug.\n\nThis data feeds the Content funnel defined in brief Section 11 and the Phase 2 Content Dashboard.",
      "acceptanceCriteria": [
        "blog_post_read fires at 75% scroll of post body with slug, title, and read_time",
        "external_link_clicked fires on outbound links in blog posts",
        "Blog CTA clicks tracked as cta_clicked with cta_location='blog_post'",
        "Events only fire when PostHog consent is granted",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-010",
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "UNBLOCKED: FEAT-013 (blog) is now live with 3 posts. All dependencies met. Add tracking to src/pages/blog/[id].astro: blog_post_viewed (slug, title on load), blog_read_depth (IntersectionObserver at 25/50/75/100% of article body), blog_cta_clicked (end-of-post CTA). Low effort sprint — add script block to blog post template. Sprint when traffic warrants measurement."
    },
    {
      "id": "FEAT-035",
      "title": "Build entity authority presence for Jodie Plant Marketing",
      "description": "Build consistent brand presence across the web to improve AI citation confidence. This is NOT a code/website task — it's an off-site authority building task that should be tracked alongside website work.\n\nRef: MARKET_RESEARCH_2026.md Part 2 — entity authority matters more than keyword volume for GEO. If a brand appears across multiple credible sources, AI systems gain confidence in recommending it.\n\nCRITICAL INSIGHT: For a GEO-led strategy, LinkedIn is the 'Home Page' for AI crawlers. AI models (Perplexity, Gemini) prioritize high-engagement social threads when looking for 'expert' citations. This makes LinkedIn the #1 entity authority channel.\n\nActions:\n- Create/optimize LinkedIn profile and company page with consistent positioning\n- LINKEDIN-FIRST CONTENT DISTRIBUTION: Post substantive content on LinkedIn first to build entity signals and engagement, then link back to the site. The LinkedIn thread IS the primary distribution — high-engagement posts create the entity authority signals AI systems use for citations. Every blog post should have a LinkedIn companion post drafted as part of content creation.\n- Register on relevant directories (Clutch, DesignRush, GoodFirms, etc.)\n- Establish presence on Reddit (r/marketing, r/startups, r/smallbusiness) with genuine value\n- Set up Google Business Profile if targeting local clients\n- Ensure NAP (name, address, phone) consistency across all listings\n- Begin collecting reviews/testimonials on Google and LinkedIn\n- Contribute to industry forums and communities\n\nGoal: When someone asks ChatGPT/Perplexity 'who are good marketing consultants for startups?', Jodie Plant Marketing should start appearing as a recommendation.",
      "acceptanceCriteria": [
        "LinkedIn personal and company profiles optimized with consistent brand positioning",
        "Listed on at least 3 relevant agency directories",
        "Active presence on at least 2 community platforms (Reddit, forums, etc.)",
        "Google Business Profile created if targeting local",
        "NAP consistency verified across all listings",
        "At least 1 review or testimonial collected"
      ],
      "priority": "must",
      "readyForSprint": false,
      "sprintable": false,
      "groomedAt": "2026-02-24",
      "groomingNotes": "URGENT MANUAL TRACK (active): Site MVP + guides + blog are live — entity authority work must have started by now. Priorities: (1) LinkedIn: post 2x/week minimum, original marketing commentary + links to guides/blog. High-engagement LinkedIn threads are the #1 source of AI citation signals. (2) Reddit: genuine answers in r/marketing, r/startups, r/SaaS — link to guides where relevant. (3) Directory listings: Clutch, GoodFirms, Crunchbase — consistent NAP across all. (4) Guest podcast/newsletter outreach: pitch Jodie as a guest to B2B marketing podcasts. Milestone: by 2026-03-10 — LinkedIn profile optimized, 5 posts published, 2+ directory listings live."
    },
    {
      "id": "FEAT-044",
      "title": "Calendly/Cal.com gating: require audit before call booking (Phase 2)",
      "description": "When calendar booking (Cal.com/Calendly) is live, add optional gating logic: require or strongly encourage completing the free audit (or AI Visibility Audit) before booking a call. E.g. calendar link on /contact could go to a short landing message: 'Best results when we've reviewed your marketing first — get your free audit, then book a call to discuss.' Or: only show calendar link after form submission. Reduces low-quality calls and aligns with conversion ladder. Phase 2 — after FEAT-014 (Cal.com integration). Per synthesis review: Calendly gating logic.",
      "acceptanceCriteria": [
        "Calendar booking flow encourages or requires audit before call (landing message, or calendar link after form submit)",
        "Documented in brief or analytics setup how gating is implemented",
        "Does not block high-intent users who need to talk first (consider 'or book a call' path)",
        "npm run build succeeds (if implementation is in-repo)"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-007",
        "FEAT-014"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "UNBLOCKED: FEAT-014 (Cal.com) is now integrated in contact.astro. Implementation: update the form confirmation message to show Cal.com booking link only after form submit (not as a standalone persistent section). This ensures prospects have shared context before booking. Keep an 'or email me directly' fallback for high-intent users. Low-effort change — update contact.astro confirmation flow."
    },
    {
      "id": "FEAT-045",
      "title": "[ABSORBED] The Visibility Engine framework section + diagram → merged into FEAT-003 and FEAT-005",
      "description": "ABSORBED into FEAT-003 (homepage section 4) and FEAT-005 (services section 2) per v2.3 review. The Visibility Engine diagram is now part of those items' scope — not a separate sprint item. Dropped ™ symbol (not trademarked). Each step now includes concrete deliverable examples.",
      "acceptanceCriteria": [
        "See FEAT-003 and FEAT-005 acceptance criteria"
      ],
      "priority": "future",
      "readyForSprint": false,
      "dependsOn": [
        "FEAT-003",
        "FEAT-005"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "ARCHIVED: Absorbed into FEAT-003 and FEAT-005 per v2.3 review. Kept for historical reference only — excluded from active sprint planning.",
      "status": "absorbed"
    },
    {
      "id": "FEAT-046",
      "title": "Bootstrap social proof: collect LinkedIn recommendations and pre-launch endorsements",
      "description": "Before site launch, collect 3–5 LinkedIn recommendations from former colleagues, managers, or clients from previous roles. These don't need to be Jodie Plant Marketing clients — they need to be credible professionals vouching for Jodie's marketing expertise.\n\nAlso: ask 2–3 trusted contacts to review the site pre-launch and provide a one-line endorsement (e.g. 'I'd hire Jodie for my startup's marketing in a heartbeat' — with name and title).\n\nThese populate the testimonials section on /results and optionally the homepage Social Proof bar at launch — avoiding empty 'testimonials coming soon' sections.\n\nRef: WEBSITE_BRIEF.md v2.3 Section 9 Results Page, 'Social Proof Bootstrapping'.",
      "acceptanceCriteria": [
        "At least 3 LinkedIn recommendations collected from credible professionals",
        "At least 2 one-line endorsements collected for site testimonials section",
        "Endorsements include name and title for credibility",
        "Content ready to populate FEAT-006 (Results page) testimonials section"
      ],
      "priority": "must",
      "readyForSprint": false,
      "sprintable": false,
      "groomedAt": "2026-02-24",
      "groomingNotes": "URGENT MANUAL TRACK (active): Results page live, TestimonialSchema.astro (FEAT-043) is ready to receive real content. The conversion impact of even 1 strong testimonial is significant. Action plan: (1) This week — reach out via LinkedIn DM to 3-5 former clients/colleagues, ask for a LinkedIn recommendation (public) or a short quote with name+title. (2) Frame the ask: 'I'm launching Jodie Plant Marketing and would love your support — even one sentence about working together would mean a lot.' (3) Once received, add to /results testimonials section and trigger TestimonialSchema markup. Milestone by 2026-03-10: 2+ testimonials live on site."
    },
    {
      "id": "FEAT-047",
      "title": "Add /guides/ index page for discoverability and internal linking",
      "description": "Create src/pages/guides/index.astro — a listing page for all 'best answer' guide pages. Currently navigating to /guides/ returns a 404. An index page improves crawlability, provides a linking target from blog posts and services, and creates a coherent content hub.\n\nContent: list all guide pages with title, one-line description, and link. Group by category if useful (e.g. 'Pricing & Budget', 'Strategy', 'Channel Mix'). Add CTA: 'Need help applying this? Get your free visibility snapshot.'\n\nAlso: add a 'Guides' link or section to the site navigation (footer at minimum, optionally header).",
      "acceptanceCriteria": [
        "/guides/ returns a branded index page (not 404)",
        "All existing guide pages listed with titles and descriptions",
        "CTA linking to /contact at bottom of page",
        "Guide pages linked from Footer or Header navigation",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-026",
        "FEAT-031",
        "FEAT-039"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "QUICK WIN: /guides/ 404 is a user experience and crawlability gap. All 4 guide pages are live. A listing page takes one sprint and creates a proper content hub. Improves internal linking and makes guides accessible via navigation. Recommend as next should-priority sprint."
    },
    {
      "id": "FEAT-048",
      "title": "Update llms.txt to include blog posts and guide pages",
      "description": "FEAT-027 created the initial llms.txt covering only the 5 MVP pages. Since then, 4 guide pages and a 3-post blog have launched. Update public/llms.txt to add:\n- Blog index page (/blog/)\n- Each blog post with title and slug\n- Guides index page (/guides/) when FEAT-047 is done\n- Each guide page with title and slug\n\nThis is a static file update — no code changes required beyond editing the file directly.",
      "acceptanceCriteria": [
        "public/llms.txt includes all guide pages with accurate descriptions",
        "public/llms.txt includes blog index and all published posts",
        "File remains clean markdown format per llms.txt convention",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-027",
        "FEAT-013",
        "FEAT-026"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "TRIVIAL WIN: llms.txt is stale — it was created before blog and guides launched. File edit only, no code change. Stack with another sprint or do as a standalone 10-minute task."
    },
    {
      "id": "FEAT-049",
      "title": "Establish ongoing content cadence (blog posts post-seed)",
      "description": "With 3 seed blog posts and 4 guide pages live, the content infrastructure is established. The next step is a sustainable content cadence to build topical authority and fresh signals for AI/search engines.\n\nThis is a MANUAL TRACK item (not a code sprint). Content cadence:\n- 2 blog posts per month minimum (one tactical how-to, one strategic perspective)\n- 1 guide page update or new guide per quarter\n- LinkedIn companion post for each piece of content (drafted as part of content creation)\n- Track in a content calendar\n\nContent priority order:\n1. Posts that answer specific buyer questions (what does a marketing retainer include, how long does SEO take)\n2. Posts that link to guide pages for internal authority\n3. Posts that demonstrate AI-enhanced workflow (process transparency)",
      "acceptanceCriteria": [
        "Content calendar created with topics planned 4-6 weeks ahead",
        "2+ new blog posts published per month",
        "Each blog post has a LinkedIn companion post",
        "Guide pages updated when new information becomes available"
      ],
      "priority": "should",
      "readyForSprint": false,
      "sprintable": false,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "MANUAL TRACK — ONGOING: Content is the fuel for entity authority (FEAT-035). 3 seed posts won't sustain topical authority signals — AI systems favour fresh, regularly updated content. Each post also creates a LinkedIn distribution opportunity (primary entity signal channel). Goal: 12 posts by end of Q2 2026. Seed posts are done; content cadence must become the default going-forward activity."
    },
    {
      "id": "FEAT-050",
      "title": "Core Web Vitals and performance audit",
      "description": "Run a Lighthouse audit and Core Web Vitals check on the live site. A marketing agency website must be fast — slow load times undermine the brand and hurt search rankings.\n\nAudit areas:\n- Lighthouse scores (Performance, Accessibility, SEO, Best Practices) on homepage, services, and contact pages\n- Core Web Vitals: LCP, CLS, INP\n- Image optimization (format, size, lazy loading)\n- Font loading strategy (Cabinet Grotesk, Space Grotesk, Inter load order)\n- Third-party script impact: PostHog, Crisp chat\n- Mobile performance\n\nFixes to implement based on findings:\n- Convert images to WebP/AVIF where applicable\n- Add width/height to prevent CLS\n- Defer non-critical third-party scripts\n- Preload critical fonts\n- Any other Lighthouse-recommended improvements\n\nTarget: Lighthouse Performance ≥90, Accessibility ≥95, SEO ≥95 on mobile.",
      "acceptanceCriteria": [
        "Lighthouse Performance score ≥90 on homepage (mobile)",
        "Lighthouse Accessibility score ≥95 on all main pages",
        "Lighthouse SEO score ≥95 on all main pages",
        "CLS (Cumulative Layout Shift) <0.1 on all pages",
        "All images have explicit dimensions and appropriate formats",
        "Font loading does not block page render",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-010",
        "FEAT-015"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): A marketing agency website must have excellent Core Web Vitals — it is a proof point as much as a technical requirement. Jodie sells marketing and AI systems; a slow or inaccessible site directly contradicts the brand. Third-party scripts (PostHog, Crisp) may be impacting performance now that all pages and features are live. All core pages are built — this is now actionable. Sprint after FEAT-047 (guides index). HIGH CREDIBILITY IMPACT: Google ranks fast sites higher, and prospects who audit Jodie's site expect it to pass the same tests she'd apply to theirs."
    },
    {
      "id": "FEAT-051",
      "title": "Add blog post reading time, author bio, and social sharing",
      "description": "Enhance individual blog post pages (/blog/[slug]) with engagement and shareability features:\n\n1. READING TIME: Calculate and display estimated reading time (words / 200 wpm). Display near article header: 'X min read'. Improves perceived quality.\n\n2. AUTHOR BIO BLOCK: Add brief author section at the end of each post. Name: Jodie Plant. Title: Marketing consultant & AI systems builder. Short bio (1–2 sentences). LinkedIn profile link. Optional: professional photo. Reinforces E-E-A-T signals.\n\n3. SOCIAL SHARING: Add LinkedIn and Twitter/X share buttons at the bottom of each post. LinkedIn is the primary distribution channel (FEAT-035 strategy). Simple URL-encoded share links — no third-party widgets.\n\n4. RELATED POSTS: Show 2 related posts at the end of each post (by category or manual selection). Reduces bounce rate and surfaces guide content.",
      "acceptanceCriteria": [
        "Estimated reading time appears on each blog post",
        "Author bio block appears at the end of each post with name, title, and LinkedIn link",
        "LinkedIn and Twitter/X share links at bottom of each post",
        "2 related posts displayed at the end of each post",
        "All additions are responsive and match brand styling",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Blog is live with 3 posts. Author bio with LinkedIn link strengthens E-E-A-T signals. LinkedIn share buttons are especially high value given the FEAT-035 LinkedIn-first distribution strategy — make it one-click for Jodie to share each post and for readers to share with their networks. Reading time signals content quality. Related posts create a content loop (blog → guides → contact). Low-effort batch sprint — all in blog post template file."
    },
    {
      "id": "FEAT-052",
      "title": "Guide: How to Measure Marketing ROI — A Startup Founder's Guide",
      "description": "Create a new best-answer guide page at /guides/how-to-measure-marketing-roi. Measuring ROI is the #1 challenge for marketers (33% per HubSpot 2026 State of Marketing), and 73% face increased budget scrutiny from leadership.\n\nTarget audience: startup founders and solo marketers who need to justify marketing spend to boards/investors.\n\nContent outline:\n- Why ROI measurement is broken (vanity metrics vs business metrics)\n- Attribution models explained simply (first-touch, last-touch, multi-touch, incrementality)\n- What to measure at each stage (awareness → consideration → conversion → retention)\n- The metrics that actually matter by channel (SEO, paid, content, email)\n- How to build a simple reporting dashboard\n- When ROI isn't the right metric (brand building, category creation)\n- FAQ section (3-5 questions)\n\nFormat: Same best-answer guide style as existing 4 guides. Include FAQ schema markup. CTA: Free visibility snapshot.\n\nSource insight: HubSpot 2026 State of Marketing — 33% cite ROI measurement as top challenge, 73% report increased budget scrutiny.",
      "acceptanceCriteria": [
        "/guides/how-to-measure-marketing-roi exists and renders correctly",
        "Content covers attribution models, channel-specific metrics, and board-level reporting",
        "FAQ section with schema markup included",
        "Internal links to relevant existing guides and services page",
        "CTA linking to /contact at bottom",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-026"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 State of Marketing report — ROI measurement is the #1 marketer challenge (33%), and 73% face increased budget scrutiny. High search intent topic that maps directly to the target audience (startup founders reporting to investors/boards). Same best-answer format as existing guides. Natural internal links to services page (Growth Attribution) and retainer guide. Strengthens topical authority cluster around marketing strategy."
    },
    {
      "id": "FEAT-053",
      "title": "Blog post: Why Short-Form Video Is the Highest-ROI Channel in 2026",
      "description": "Write a blog post covering why short-form video has become the #1 ROI format for marketers and how startups can get started without a production budget.\n\nKey data points to reference (HubSpot 2026 State of Marketing):\n- Short-form video: 48.6% say highest ROI (vs 28.6% long-form, 25.1% live-stream)\n- 91% of businesses use video as a marketing tool\n- Video marketing is a top-3 area for budget increases (37.1%)\n\nContent outline:\n- The data: why video outperforms every other format\n- Why startups avoid video (and why those reasons are wrong)\n- 5 short-form video formats that work for B2B tech (founder talking head, product demos, customer snippets, behind-the-scenes, hot takes)\n- The minimum viable video stack (phone + natural light + CapCut)\n- Platform strategy: LinkedIn vs TikTok vs YouTube Shorts vs Instagram Reels for B2B\n- How AI tools accelerate video production (scripting, editing, repurposing)\n- CTA: Get your free visibility snapshot\n\nTone: Practical, action-oriented. Not 'video is important' — 'here's how to start this week.'",
      "acceptanceCriteria": [
        "Blog post published at /blog/short-form-video-highest-roi-2026",
        "Includes specific data points from HubSpot report",
        "Actionable advice for startups with limited budgets",
        "Internal links to services page (Social Media & Short-Form Video)",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — video is the #1 ROI format but the site barely mentions it. This post supports FEAT-055 (elevating video prominence) and creates content to distribute via LinkedIn (FEAT-035 entity authority). Also addresses FEAT-049 content cadence goal. Good candidate for early content calendar slot."
    },
    {
      "id": "FEAT-054",
      "title": "Blog post: AI Personalization for Startups — Competing Without Enterprise Budgets",
      "description": "Write a blog post about how startups can use AI-driven personalization without enterprise MarTech stacks.\n\nKey data points (HubSpot 2026 State of Marketing):\n- AI-driven personalization is the #1 marketing trend (48.6%)\n- 93.2% say personalization drives more leads/purchases\n- 96% say it strengthened customer relationships\n- Only 12.6% do hyper-personalization — most use basic segmentation\n\nContent outline:\n- The personalization gap: enterprise vs startup capabilities\n- What 'personalization' actually means at startup scale (not 1:1, but smart segmentation)\n- 5 practical AI personalization tactics for startups:\n  1. AI-powered email segmentation and send-time optimization\n  2. Dynamic landing page content by traffic source\n  3. Chatbot conversations that adapt to visitor context\n  4. Content recommendations based on browsing behavior\n  5. Ad creative personalization at scale\n- Tools that make it accessible (free/affordable tiers)\n- When personalization isn't worth the effort (small audiences, early stage)\n- CTA: Free visibility snapshot\n\nTone: Demystifying, practical. Cut through the enterprise hype.",
      "acceptanceCriteria": [
        "Blog post published at /blog/ai-personalization-for-startups",
        "Includes HubSpot data points on personalization trends",
        "Practical tactics with tool recommendations",
        "Internal links to AI Marketing Systems service",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — personalization is the #1 trend but the site barely mentions it. This post positions Jodie's AI Marketing Systems service as a solution. Also supports FEAT-064 (adding personalization to service copy). Content cadence item (FEAT-049)."
    },
    {
      "id": "FEAT-055",
      "title": "Elevate video prominence on homepage and services page",
      "description": "Short-form video is the #1 ROI content format (48.6% per HubSpot 2026), but 'Social Media & Short-Form Video' is buried as service #6 on the services page, and video isn't mentioned in the homepage Growth Engines section.\n\nChanges:\n1. HOMEPAGE: Add video as a visible element in the Growth Engines section or as a standalone callout. Consider adding it as a 4th engine or incorporating it into the 'Authority Content' engine description.\n2. SERVICES PAGE: Move 'Social Media & Short-Form Video' higher in the service list (consider position 3-4 instead of 6), OR add a prominent callout about video ROI near the top of the services page.\n3. RESULTS PAGE: Add video-related typical outcomes to the results methodology section if applicable.\n\nDo NOT restructure the entire page — targeted copy and ordering changes only.",
      "acceptanceCriteria": [
        "Video/short-form content is visible on homepage without deep scrolling",
        "Video service is more prominent on services page (higher position or callout)",
        "Changes are copy/ordering only — no structural redesign",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": [],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — video is THE top ROI format but is underweight on the site. An agency selling marketing in 2026 needs to signal video competence prominently. Low effort — copy and ordering changes to existing pages. No new pages required.",
      "passes": true,
      "status": "done",
      "completedAt": "2026-02-24T22:36:19-08:00"
    },
    {
      "id": "FEAT-056",
      "title": "Add third-party data citations to SEO/GEO and AI service sections",
      "description": "The site claims AI search matters and positions SEO+GEO as service #1, but doesn't cite any third-party data to back these claims. Adding industry statistics builds credibility and supports E-E-A-T signals.\n\nData points to incorporate (HubSpot 2026 State of Marketing + other sources):\n- 50% of consumers now use AI-powered search\n- Half of Google searches include an AI Overview\n- 40.6% of marketers are updating SEO strategies for AI search\n- 86.4% of marketing teams use AI tools\n- Short-form video is #1 ROI format (48.6%)\n\nPlacement:\n1. SERVICES PAGE: Add a data callout near the SEO & AI Visibility service (e.g. '50% of consumers now use AI-powered search — HubSpot 2026')\n2. HOMEPAGE: Consider adding a brief stat in the Search & AI Visibility growth engine section\n3. GUIDE PAGES: Update relevant guides with fresh data where applicable\n\nKeep citations light — one or two per section, not a data dump. Link to sources where appropriate.",
      "acceptanceCriteria": [
        "At least 2 third-party data points added to services page",
        "At least 1 data point added to homepage growth engines section",
        "Sources cited inline or in footnotes",
        "Data points are accurate and attributed",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": [],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): The site makes strong claims about AI search disruption but doesn't back them with third-party data. Citing HubSpot (1,500+ marketers surveyed) adds instant credibility. Low effort — targeted copy additions to existing pages. Also improves E-E-A-T signals for search."
    },
    {
      "id": "FEAT-057",
      "title": "Blog post: The Marketing Workload Crisis — Why Founders Are Burning Out",
      "description": "Write a blog post addressing the marketing workload crisis and positioning fractional CMO / AI-enhanced marketing as the solution.\n\nKey data points (HubSpot 2026 State of Marketing):\n- 73% of marketers saw workload increase significantly or moderately\n- 83.5% are expected to produce more content\n- 70% believe marketing changed more in 3 years than the prior 50\n- 37.9% say leadership views marketing as less important (despite expecting more output)\n\nContent outline:\n- The numbers: marketing workload is at breaking point\n- Why startup founders have it worst (wearing the marketing hat on top of everything else)\n- The 'do more with less' trap (and why it eventually breaks)\n- Three models that actually solve the problem (hire, outsource, or go fractional)\n- How AI-enhanced workflows change the equation (real efficiency, not buzzwords)\n- When to stop DIY and get help (honest signals)\n- CTA: Free visibility snapshot\n\nTone: Empathetic but practical. Name the pain, then offer the path forward.",
      "acceptanceCriteria": [
        "Blog post published at /blog/marketing-workload-crisis-founder-burnout",
        "Includes HubSpot data on workload increases",
        "Positions fractional CMO model as solution without being sales-heavy",
        "Internal links to about page and fractional CMO guide",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — workload/burnout is a major industry theme. Speaks directly to the target audience (overwhelmed founders). Natural bridge to the fractional CMO positioning and existing guide on Fractional CMO vs Agency vs In-House. Good LinkedIn content — high empathy = high engagement. Content cadence item (FEAT-049)."
    },
    {
      "id": "FEAT-058",
      "title": "Blog post: Defending Your Marketing Budget to the Board — What Metrics Matter",
      "description": "Write a blog post helping startup founders and marketing leaders justify marketing spend to boards and investors.\n\nKey data points (HubSpot 2026 State of Marketing):\n- 73% report increased budget scrutiny\n- 33% say measuring ROI is their top challenge\n- 79.2% expect budget increases — but need to justify them\n- 37.9% say leadership views marketing as less important\n\nContent outline:\n- The budget scrutiny reality: more expected, more questioned\n- Why 'marketing metrics' don't work in board meetings (nobody cares about impressions)\n- The 5 metrics boards actually care about (CAC, LTV, pipeline contribution, payback period, revenue attribution)\n- How to build a one-page marketing dashboard for investors\n- Framing marketing as investment, not cost (with specific language)\n- The 'marketing changed more in 3 years than 50' problem — educating leadership\n- CTA: Free visibility snapshot\n\nTone: Practical, board-room ready. Provide templates and frameworks, not theory.",
      "acceptanceCriteria": [
        "Blog post published at /blog/defending-marketing-budget-board-metrics",
        "Includes specific metrics and frameworks for board reporting",
        "Internal links to ROI guide (FEAT-052) and services page",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Companion piece to FEAT-052 (ROI guide) — this one is blog-length and more tactical. Addresses the budget scrutiny trend (73%) directly. High-intent search topic: founders searching for 'how to justify marketing budget' are exactly the right audience. Pairs well with the fractional CMO positioning (senior marketer who speaks board language). Content cadence item (FEAT-049)."
    },
    {
      "id": "FEAT-059",
      "title": "Blog post: Micro-Influencer Marketing for B2B Tech — A Practical Playbook",
      "description": "Write a blog post on micro-influencer partnerships for B2B tech companies.\n\nKey data points (HubSpot 2026 State of Marketing):\n- Micro-influencers are the most successful tier (32.4%)\n- 5x higher impressions and 6x higher engagement reported in case studies\n- 21.2% of brands use influencer partnerships (18.6% B2B — growing)\n\nContent outline:\n- Why micro-influencers outperform macro (authenticity, niche audiences, cost)\n- The B2B influencer landscape (it's not just B2C anymore)\n- How to find the right micro-influencers for your niche (tools, signals, vetting)\n- Typical costs and what to expect ($100-$500/post for micro-influencers)\n- 4 campaign formats that work for B2B tech (product reviews, co-created content, podcast appearances, LinkedIn collaborations)\n- Measuring influencer ROI (tracking codes, UTMs, attributed pipeline)\n- Common mistakes (paying for followers, no brief, no tracking)\n- CTA: Free visibility snapshot\n\nExpands on the brief micro-influencer mention in the existing 'Leads Without Ads' guide.",
      "acceptanceCriteria": [
        "Blog post published at /blog/micro-influencer-marketing-b2b-tech",
        "Includes specific cost ranges and ROI data",
        "Practical playbook format with actionable steps",
        "Internal links to leads-without-ads guide",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — micro-influencers are the most effective tier but barely covered on the site. Expands on a brief mention in the leads-without-ads guide. B2B influencer marketing is an emerging differentiator — most agencies still think of influencers as B2C only. Good LinkedIn content topic. Content cadence item (FEAT-049)."
    },
    {
      "id": "FEAT-060",
      "title": "Blog post: The 5 AI Marketing Skills Every Startup Needs in 2026",
      "description": "Write a blog post about the AI skills gap in marketing and what startups need to know.\n\nKey data points (HubSpot 2026 State of Marketing):\n- AI/automation prompting is the #1 most in-demand marketing skill\n- Finding candidates with the right skill set is the top hiring challenge\n- 86.4% of teams use AI but confidence and measurement lag behind\n- 68.2% understand AI applications (up from 47% in 2025 — still a gap)\n\nContent outline:\n- The AI skills gap: everyone uses AI, few use it well\n- Skill 1: Prompt engineering for marketing (beyond 'write me a blog post')\n- Skill 2: AI-augmented research and competitive intelligence\n- Skill 3: AI-powered content workflows (not just generation — editing, distribution, repurposing)\n- Skill 4: Marketing data analysis with AI (turning dashboards into insights)\n- Skill 5: AI tool evaluation and stack building (knowing what's worth paying for)\n- The meta-skill: knowing when NOT to use AI\n- How to build these skills (resources, practice frameworks)\n- CTA: Free visibility snapshot (or: 'want someone who already has these skills?')\n\nTone: Educational, not gatekeeping. Position Jodie as the expert who already has these skills.",
      "acceptanceCriteria": [
        "Blog post published at /blog/ai-marketing-skills-startups-2026",
        "Includes practical skill descriptions with examples",
        "Internal links to about page (AI advantage section) and services",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — AI skills are the #1 hiring challenge but the site has no content about it. Positions Jodie as someone who already has these skills (implied CTA: why build internally when you can access them now?). Good LinkedIn content — skill-gap posts get high engagement. Content cadence item (FEAT-049)."
    },
    {
      "id": "FEAT-061",
      "title": "Blog post: Why Brand Positioning Is Your Most Underrated Growth Lever in 2026",
      "description": "Write a blog post about brand positioning as a growth lever, especially for startups that skip straight to performance marketing.\n\nKey data points (HubSpot 2026 State of Marketing):\n- 46.8% of marketers prioritizing brand values-based content (#3 trend)\n- 75% have clear values positioning, but only 23.9% strongly agree\n- Growth is increasingly driven by distinctiveness, trust, and relevance\n\nContent outline:\n- Why startups skip positioning (speed bias, 'we'll figure it out later')\n- The cost of bad positioning (every campaign works harder, nothing compounds)\n- Positioning vs branding vs messaging (clear definitions)\n- The 3-question positioning framework (who, what differently, why it matters)\n- How positioning makes everything else work better (ads, content, sales)\n- When to revisit positioning (stage triggers, market shifts, new competitors)\n- Brand values as a content strategy (the 46.8% trend)\n- CTA: Free visibility snapshot (includes positioning review)\n\nTone: Strategic but accessible. Make the abstract concrete with examples.",
      "acceptanceCriteria": [
        "Blog post published at /blog/brand-positioning-growth-lever-2026",
        "Includes actionable positioning framework",
        "Internal links to fractional CMO guide and services page",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [
        "FEAT-013"
      ],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — brand values-based content is #3 trend, but the site has no content addressing positioning as a capability. Supports FEAT-055 (elevating services) and the fractional CMO positioning (positioning IS what a CMO does). High engagement LinkedIn topic. Content cadence item (FEAT-049)."
    },
    {
      "id": "FEAT-062",
      "title": "Update Visibility Engine to emphasize cyclical/iterative nature",
      "description": "The Visibility Engine (Discover → Dominate → Amplify → Optimize) is currently presented as a linear 4-step process. HubSpot's 2026 report introduces 'Loop Marketing' — a repeatable cycle where each stage feeds the next. The Visibility Engine already IS a loop (Optimize feeds back into Discover), but this isn't visually or verbally communicated.\n\nChanges:\n1. Add a visual arrow or connection from Optimize back to Discover (on homepage and services page)\n2. Add a brief line like 'Then we loop back — each cycle compounds on the last' after the 4th step\n3. Consider adding 'continuous' or 'compounding' language to the Optimize step description\n\nDo NOT rebrand or restructure. Minimal copy and visual changes to communicate the iterative nature.",
      "acceptanceCriteria": [
        "Visual connection from Optimize back to Discover on homepage and services page",
        "Copy communicates iterative/compounding nature",
        "No structural redesign — minimal changes only",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Inspired by HubSpot's Loop Marketing framework. The Visibility Engine is already conceptually a loop but presented linearly. Making the cycle explicit reinforces the retainer model (why month-to-month compounds) and aligns with industry direction. Very small change — a visual arrow and 1-2 lines of copy. Low effort, high alignment."
    },
    {
      "id": "FEAT-063",
      "title": "Add content repurposing as explicit service deliverable",
      "description": "Content repurposing is the #5 marketing trend (35.1% per HubSpot 2026), and startups with limited budgets want to know that one piece of content becomes multiple assets. This is already what Jodie does but it's not called out explicitly.\n\nChanges:\n1. SERVICES PAGE — Authority Content service: Add 'content repurposing' as an explicit deliverable (e.g. 'One blog post becomes a LinkedIn carousel, email snippet, Twitter thread, and short-form video script')\n2. SERVICES PAGE — Retainer descriptions: Mention cross-channel repurposing in Growth and Authority tiers\n3. Optionally add to the 'What's Included in a Marketing Retainer' guide\n\nMinimal copy additions — not a new service, just making an existing capability visible.",
      "acceptanceCriteria": [
        "Content repurposing mentioned as deliverable in Authority Content service",
        "Retainer tier descriptions reference cross-channel repurposing",
        "Changes are copy additions only — no structural changes",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — 35.1% of marketers prioritize content repurposing, but the site doesn't mention it. Making it explicit adds perceived value to retainers ('you get 5 assets from every blog post, not just 1'). Trivial copy changes to services page. Stack with FEAT-055 or FEAT-056."
    },
    {
      "id": "FEAT-064",
      "title": "Add AI personalization capability to AI Marketing Systems service copy",
      "description": "AI-driven personalization is the #1 marketing trend (48.6% per HubSpot 2026), with 93.2% saying it drives more leads. The AI Marketing Systems service (#2 on services page) describes automation but doesn't mention personalization as a capability.\n\nChanges:\n1. SERVICES PAGE — AI Marketing Systems: Add personalization to the service description and deliverables (e.g. 'AI-powered audience segmentation and content personalization')\n2. Add personalization to the 'AI difference' callout for this service\n3. Optionally update the homepage Growth Engines section to mention personalization\n\nMinimal copy additions to existing service description.",
      "acceptanceCriteria": [
        "AI Marketing Systems service mentions personalization as a capability",
        "Deliverables include audience segmentation or content personalization",
        "Changes are copy additions only",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": [],
      "groomedAt": "2026-02-24",
      "groomingNotes": "NEW (2026-02-24): Gap identified from HubSpot 2026 report — personalization is the #1 trend but barely mentioned on the site. The AI Marketing Systems service is the natural home for this. Trivial copy change — one or two sentences added to service description and deliverables. Stack with FEAT-054 (personalization blog post) for coherent messaging."
    }
  ],
  "_dependsOn_docs": "Items may include an optional 'dependsOn' array of item ID strings (e.g. \"dependsOn\": [\"FEAT-001\"]). Auto-pick skips items whose dependencies are not yet done."
}
