{
  "description": "Feature backlog — www.jodieplant.com (ref: docs/WEBSITE_BRIEF.md v2.0)",
  "items": [
    {
      "id": "FEAT-001",
      "title": "Install Tailwind CSS and configure brand design tokens",
      "description": "Install @astrojs/tailwind and tailwindcss. Create tailwind.config.mjs with the design tokens from WEBSITE_BRIEF.md Section 7 (v2.0):\n\nColors: Dark #0F172A (navy — nav, footer, dark sections), Accent #FF6B35 (warm orange — CTAs, links, brand mark), Accent Secondary #6366F1 (indigo — supporting highlights), Light BG #FFFFFF/#F8FAFC, Text #1E293B (slate-800), Muted #64748B (slate-500).\n\nTypography: Cabinet Grotesk (700-800) for headlines — this is the bold brand differentiator. Inter (400-500) for body. Space Grotesk (500-700) for stats/callouts/numbers. Load Cabinet Grotesk and Space Grotesk via Google Fonts or Fontsource. Inter can use system font stack or Fontsource.\n\nBreakpoints: Mobile <640px, Tablet 640-1024px, Desktop >1024px with max-width 1280px container.\n\nAdd a base CSS layer with font-face declarations and CSS custom properties for the brand colors. Ensure the orange (#FF6B35) passes WCAG AA contrast on both navy and white backgrounds for large text.",
      "acceptanceCriteria": [
        "Tailwind CSS is installed and integrated with Astro via @astrojs/tailwind",
        "tailwind.config.mjs defines all brand colors (navy, orange, indigo, light, text, muted), fonts, and breakpoints from brief Section 7",
        "Cabinet Grotesk, Space Grotesk, and Inter fonts are loaded and available",
        "Orange accent (#FF6B35) passes WCAG AA contrast check for large text on navy and white",
        "npm run build succeeds with Tailwind configured"
      ],
      "priority": "must",
      "readyForSprint": true,
      "groomedAt": "2026-02-23",
      "groomingNotes": "FOUNDATION: Everything depends on this. Must be first sprint. The bold color/type choices are a key differentiator — Cabinet Grotesk for headlines and orange accent are deliberate departures from generic tech aesthetic."
    },
    {
      "id": "FEAT-002",
      "title": "Build Layout.astro shell with Header and Footer components",
      "description": "Rebuild src/layouts/Layout.astro as the base HTML shell for all pages. It should accept props for title, description, and ogImage.\n\nCreate src/components/Header.astro — responsive navigation per brief Section 8 (v2.0):\n- Nav links: Services, Results, About\n- CTA button: 'Get Your Free Audit' (orange #FF6B35 background) linking to /contact\n- Mobile: hamburger menu (JavaScript island or CSS-only)\n- Sticky header on scroll\n- Brand name 'Jodie Plant' as text in Cabinet Grotesk (no image logo yet)\n\nCreate src/components/Footer.astro per brief Section 8 (v2.0):\n- Links: Services | Results | About | Contact\n- Email: jodie@jodieplant.com\n- LinkedIn link placeholder\n- Availability signal: 'Currently taking on new clients for Q2 2026'\n- Copyright: © 2026 Jodie Plant Marketing\n- Dark background (navy #0F172A) with light text\n\nLayout wraps Header + <slot /> + Footer. Includes viewport meta, favicon links, font loading, and prefers-reduced-motion support.",
      "acceptanceCriteria": [
        "Layout.astro accepts title, description, and optional ogImage props",
        "Header shows nav links (Services, Results, About) and orange 'Get Your Free Audit' CTA button",
        "Header is sticky and responsive — hamburger menu on mobile (<640px)",
        "Footer shows page links, email, availability signal, and copyright on dark navy background",
        "Touch targets are minimum 44x44px on mobile",
        "Cabinet Grotesk is used for brand name in header",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-001"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "FOUNDATION: Layout, Header, and Footer are the structural shell. The orange CTA in the nav and availability signal in the footer are conversion elements that appear on every page."
    },
    {
      "id": "FEAT-003",
      "title": "Build Homepage with condensed high-impact sections",
      "description": "Build src/pages/index.astro as the homepage per brief Section 9 (v2.0). Condensed to 5 high-impact sections (down from 7). Startup founders are time-poor — every section must earn the next scroll.\n\nSections (in order):\n\n1. HERO (above the fold, dark navy background):\n- Headline in Cabinet Grotesk 800, large scale (e.g., 'Marketing that moves the needle for tech companies')\n- Subhead: 1-2 sentences — AI-forward, senior-level, full-service value prop\n- Primary CTA: 'Get Your Free Marketing Audit' (orange button → /contact)\n- Secondary CTA: 'See How I Work' (text link → /results)\n- Availability signal: small text 'Currently taking on 2 new clients for Q2 2026'\n- Visual: clean typographic hero, subtle geometric pattern or gradient. No stock photos\n\n2. SOCIAL PROOF BAR (immediately after hero — most important trust signal):\n- 3-4 credential stats in Space Grotesk at large scale with orange accent on key numbers\n- Stats MUST be real: years experience, campaigns delivered, ad spend managed, etc.\n- If client logos available: 'Trusted by' logo bar\n- If testimonial available: one pull quote\n- Light background. This section appears before any other content because trust comes first for services businesses\n\n3. HOW I'M DIFFERENT (combines old Problem + Jodie Difference):\n- Opening line: 'Tired of agencies that hand you off to juniors?'\n- Three bold differentiator cards: AI-Powered, Senior-Level Always, Full-Service\n- Each card: orange icon/accent + title + 1-2 sentence explanation\n- CTA: 'See what I'd do for your startup →' linking to /contact\n\n4. SERVICES OVERVIEW:\n- Intro line: 'Full-service marketing. Every channel. One partner.'\n- 5 hero service cards in responsive grid (3+2 or 2+3 desktop, stacked mobile)\n- The 5 hero services (ordered by differentiation):\n  1. Search & AI Visibility — 'Get found by people — and AI — already searching for what you sell.'\n  2. AI Marketing Systems — 'Build the AI workflows that make your marketing faster and smarter.'\n  3. Authority Content & AI Citation — 'Content that ranks, gets cited by AI, and converts.'\n  4. Smart-Stack Paid Media — 'Turn ad spend into pipeline — on the platforms where your budget works.'\n  5. Fractional Marketing Leadership — 'CMO-level strategy and execution, without the CMO salary.'\n- Each card: icon + service name + one-line benefit\n- Each links to /services (relevant section anchor)\n- Below grid: 'See all services →' text link to /services\n- Reduced from 8 to 5 to sharpen homepage positioning. Full menu lives on /services.\n\n5. FINAL CTA (dark navy background):\n- Headline: 'Ready to see what AI-powered marketing can do for your startup?'\n- Orange CTA button: 'Get Your Free Marketing Audit' → /contact\n- Supporting text: 'Or email me directly: jodie@jodieplant.com'\n- Availability: 'Currently accepting new clients for Q2 2026'\n\nTone: Bold, confident, direct. Use Cabinet Grotesk for all section headlines.",
      "acceptanceCriteria": [
        "Homepage has exactly 5 sections: Hero, Social Proof Bar, How I'm Different, Services Overview, Final CTA",
        "Hero has dark navy background with bold Cabinet Grotesk headline and orange CTA",
        "Social proof bar appears immediately after hero with real credential stats (not placeholder)",
        "How I'm Different section has 3 differentiator cards with orange accents",
        "Services overview shows 5 hero cards in responsive grid linking to /services, plus 'See all services' link",
        "Final CTA uses dark navy background with orange button",
        "Availability signal appears in hero and final CTA sections",
        "All internal links work (/services, /results, /contact)",
        "Page is fully responsive (single column mobile, multi-column desktop)",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "CRITICAL: Primary conversion page. Social proof bar placement (immediately after hero) is a deliberate best-practice decision — trust before content. Stats must be real numbers."
    },
    {
      "id": "FEAT-004",
      "title": "Build About page with story, approach, and AI advantage",
      "description": "Build src/pages/about.astro per brief Section 9 (v2.0) 'About Page'.\n\nPurpose: Build trust and personal connection. 'Solo' means 'senior-level attention' not 'under-resourced.'\n\nSections:\n\n1. HERO: Cabinet Grotesk headline 'One marketer. Full attention. Real results.' Brief positioning statement.\n\n2. JODIE'S STORY: Background and experience. Why she started the agency. Philosophy: senior talent, AI-enhanced, no bloat. Authentic voice — personal, not corporate. Use placeholder copy that captures the right tone (to be replaced with real bio).\n\n3. THE APPROACH: 4 numbered steps — (1) Understand your business, (2) Build data-driven strategy, (3) Execute with AI-enhanced workflows, (4) Measure, report, iterate. Visual: numbered steps or timeline. Emphasis on transparency.\n\n4. THE AI ADVANTAGE: How AI tools deliver better results — research at scale, content optimization, campaign management, reporting. Key message: augmenting human strategy, not replacing it.\n\n5. CTA: 'Let's talk about your marketing' with links to /contact (form) AND jodie@jodieplant.com (email) — dual paths.",
      "acceptanceCriteria": [
        "About page has all 5 sections: Hero, Story, Approach, AI Advantage, CTA",
        "Hero uses Cabinet Grotesk headline",
        "Story section has placeholder bio in bold, personal tone (not corporate)",
        "Approach section shows 4 numbered steps in a visually clear format",
        "AI Advantage section explains how AI enhances marketing delivery",
        "CTA offers both form link (/contact) and direct email",
        "Page is fully responsive",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Trust page for a solo practitioner. The AI Advantage section is unique to this agency and reinforces the core differentiator."
    },
    {
      "id": "FEAT-005",
      "title": "Build Services page with AI-led structure and engagement models",
      "description": "Build src/pages/services.astro per brief Section 9 (v2.0) 'Services Page'.\n\nCRITICAL: This page must NOT read like a generic freelancer service list. Lead with the AI method, not just the menu.\n\nSections:\n\n1. HERO: Cabinet Grotesk headline 'AI-Powered Marketing for Tech Companies'. Subhead about AI-enhanced workflows giving agency output from a senior practitioner.\n\n2. THE AI-ENHANCED METHOD (before individual services): Brief explanation of how AI changes marketing delivery. Specific examples, not generic AI pitch. This section is what makes the page different from every other freelancer's site.\n\n3. SERVICE BLOCKS: 9 services (Growth Attribution & AI Insights presented as 'included infrastructure'), each structured as 'AI difference + Deliverables + Client benefit'. Order by differentiation strength: (1) Search & AI Visibility (SEO + GEO), (2) AI Marketing Systems, (3) Authority Content & AI Citation (was Content Marketing), (4) Smart-Stack Paid Media (was Paid Advertising), (5) Fractional Marketing Leadership, (6) Social Media & Short-Form Video, (7) Conversion Rate Optimization, (8) Local Visibility & Reputation, (9) Email Marketing & Owned Audience.\n\nGrowth Attribution & AI Insights (was Performance Intelligence; analytics & reporting) is not a standalone service block — it's featured in a 'What's always included' section after the service blocks.\n\nEach block has:\n- Service name and icon (orange accent)\n- 'The AI difference' — 1-2 sentences specific to THIS service (from brief Section 5)\n- Key deliverables (3-5 bullets)\n- Benefit one-liner\n\nAlternating layout to prevent monotony.\n\n4. PACKAGES & PRICING: Three tiered retainer packages (Foundation $1,500-$2,500 / Growth $2,500-$4,500 / Authority $4,500-$7,500) as pricing cards with orange accent on recommended tier (Growth). Plus one-time projects. Each card shows what's included, who it's for, price range, CTA to /contact. What a typical month looks like at each tier. Reporting cadence. Authority tier should explicitly include 'Fractional marketing leadership' language. Add a 'Strategy Sprint' one-time project ($3,000-$7,000) for funded startups preparing launches, market entries, or pivots — this fills the gap between free audit and committed retainer.\n\n5. CTA: 'Not sure what you need? Let's figure it out together.' + 'Get Your Free Marketing Audit' → /contact + jodie@jodieplant.com.",
      "acceptanceCriteria": [
        "Services page has Hero, AI Method section, 8 Service Blocks, Pricing, and CTA",
        "AI-Enhanced Method section appears BEFORE individual services",
        "Services use outcome-first names (Search & AI Visibility, AI Marketing Systems, Authority Content & AI Citation, Smart-Stack Paid Media, Growth Attribution & AI Insights) with technical terms (SEO, GEO) in subtext",
        "Services ordered by differentiation strength (Search & AI Visibility first); Growth Attribution & AI Insights presented as included infrastructure, not standalone",
        "Pricing section shows Foundation/Growth/Authority tiers with price ranges and one-time projects",
        "All service blocks are scannable with alternating visual layout",
        "Orange accents used for service icons and highlights",
        "CTA offers form link and email",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "CRITICAL: This page must differentiate from every other marketing freelancer. The AI-led structure is the key — method before menu. Service ordering (most differentiating first) is deliberate. Service names use outcome-first language (Authority Content & AI Citation, Smart-Stack Paid Media, Growth Attribution & AI Insights) with technical terms in subtext. This naming strategy differentiates from the hundreds of other freelancers on LinkedIn. Fractional Marketing Leadership and CRO are new additions. Analytics (Growth Attribution) folded into 'always included' to avoid looking like table stakes."
    },
    {
      "id": "FEAT-006",
      "title": "Build Results page with real credentials and methodology (not fake case studies)",
      "description": "Build src/pages/results.astro per brief Section 9 (v2.0) 'Results Page'.\n\nCRITICAL: This is NOT a portfolio page with fake case studies. Placeholder case studies with fabricated metrics actively harm credibility. This page uses real credentials and methodology to demonstrate expertise.\n\nSections:\n\n1. HERO: Cabinet Grotesk headline 'What You Can Expect'. Subhead: honest framing — 'I don't have a portfolio of logos to hide behind. Here's what I bring instead — real experience, a proven approach, and the results to back it up.'\n\n2. CREDENTIALS & NUMBERS: Real, provable stats in Space Grotesk at large scale — years experience, campaigns/projects delivered, ad spend managed, client retention, industries worked with. MUST be real. Small but honest beats large but fabricated.\n\n3. THE APPROACH IN ACTION: Instead of fake case studies, show methodology applied:\n- 'What a typical SEO engagement looks like' — month-by-month\n- 'How I'd approach a startup launch campaign' — step-by-step\n- 'What a monthly retainer delivers' — concrete deliverables\nDemonstrates expertise without fabricating results.\n\n3b. 'PEEK UNDER THE HOOD' — VISUAL PROCESS PROOF:\nDon't just list what you do — VISUALIZE the workflow. Prospects are skeptical of AI claims. Show actual artifacts:\n- Blurred/redacted screenshot of an AI-enhanced research workflow or audit output\n- Sample 'AI Visibility Report' structure (designed mockup with real formatting, anonymized data)\n- Before/after of an AI-optimized content piece\n- Dashboard screenshot showing type of reporting (redacted data)\nUse subtle frame/border treatment to make these feel like real documents. This section is the most powerful differentiator on the page — it proves Jodie is a systems builder, not just a prompt engineer.\n\n4. WHAT CLIENTS SAY: Real testimonials, LinkedIn recommendations, or professional endorsements. Even 1-2 is better than none. If no client testimonials exist: results from past roles with appropriate framing. Structure ready for adding real testimonials later.\n\n5. INDUSTRIES & EXPERIENCE: Types of companies Jodie works with — SaaS, fintech, dev tools, etc. Pattern recognition: 'I've seen what works for companies like yours.'\n\n6. CTA: 'Want to see what I'd do for your company?' + 'Get Your Free Marketing Audit' → /contact.",
      "acceptanceCriteria": [
        "Results page has Hero, Credentials, Approach in Action, Client Testimonials, Industries, and CTA",
        "No fake case studies or fabricated metrics anywhere on the page",
        "Credentials section uses Space Grotesk at large scale for real stats",
        "Approach in Action section shows methodology through real scenario walkthroughs",
        "'Peek Under the Hood' section includes at least 2 visual artifacts (blurred screenshots, sample report mockups, or dashboard examples) proving the AI-enhanced workflow",
        "Testimonials section has structure ready for real content (even if placeholder notes 'coming soon')",
        "Hero acknowledges the honest positioning rather than pretending to have a portfolio",
        "Page is fully responsive",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Reframed from fake portfolio to honest credentials page. This is more credible and more useful for a new agency. The methodology walkthroughs answer 'what do I actually get?' which is what prospects really want to know. NEW: 'Peek Under the Hood' section (per external strategy review) adds visual proof of AI-enhanced workflows — blurred screenshots, sample reports, dashboard mockups. This is the most powerful differentiator for countering AI skepticism."
    },
    {
      "id": "FEAT-007",
      "title": "Build Contact page with form, email, and calendar — multiple conversion paths",
      "description": "Build src/pages/contact.astro per brief Section 9 (v2.0) 'Contact Page'.\n\nCRITICAL: Multiple conversion paths, not just mailto:. A form is lower friction than composing an email from scratch. Different prospects prefer different channels.\n\nSections:\n\n1. HERO: Cabinet Grotesk headline 'Let's Talk'. Subhead: 'Whether you want a free audit, have a quick question, or are ready to get started — I'm here.'\n\n2. FREE MARKETING AUDIT FORM (primary conversion path):\n- Headline: 'Get Your Free Marketing Audit'\n- Description: 'Tell me a bit about your company and I'll send you a personalised assessment...'\n- Form fields (in this order — order matters for conversion):\n  1. Name\n  2. Company name\n  3. Company URL\n  4. Biggest marketing challenge (short text or dropdown)\n  5. Budget range (optional dropdown: <$2k, $2-5k, $5-10k, $10k+) — MUST be LAST. Asking for money too early causes drop-offs. If form_abandoned tracking shows users quitting at budget, the value prop hasn't justified the price tag yet.\n- Submit to Formspree or Formspark (static-site compatible, sends to email)\n- Confirmation: 'Thanks! I'll review your marketing and get back to you within 24 hours.'\n- Form validation with helpful error messages\n\n3. OTHER WAYS TO REACH ME:\n- Email: jodie@jodieplant.com with mailto: link\n- Book a call: placeholder for Cal.com/Calendly link (Phase 2) — can show as 'Coming soon' or omit until ready\n- LinkedIn: profile link\n\n4. WHAT TO EXPECT:\n- 'I respond to every enquiry within 24 hours'\n- 'Audit responses include a personalised assessment, not a generic template'\n- 'No pressure, no hard sell'\n\n5. AVAILABILITY:\n- 'Currently taking on 2 new clients for Q2 2026'\n- Creates urgency without being pushy",
      "acceptanceCriteria": [
        "Contact page has Hero, Audit Form, Other Contact Methods, Expectations, and Availability sections",
        "Form has fields for name, company, URL, challenge, and optional budget range — budget range MUST be the last field (reduces drop-off)",
        "Form submits to Formspree/Formspark (or similar static-compatible service) and sends to email",
        "Form shows confirmation message after successful submission",
        "Form has client-side validation with helpful error messages",
        "Email mailto: link is prominent alongside the form (not hidden)",
        "Availability signal creates urgency ('Currently taking on 2 new clients')",
        "Calendar booking link has placeholder structure for Phase 2",
        "Page is fully responsive",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "CRITICAL: Conversion endpoint. The form is lower friction than mailto: — prospect doesn't need to context-switch to email client. The audit framing gives the prospect something concrete in return for reaching out. Availability signal drives urgency."
    },
    {
      "id": "FEAT-008",
      "title": "Add SEO meta tags, Open Graph, and Twitter cards to all pages",
      "description": "Update Layout.astro and all 5 pages to include proper SEO meta tags per brief Section 12 (v2.0).\n\nEach page needs: <title>, <meta name='description'>, Open Graph tags (og:title, og:description, og:type, og:url, og:image, og:site_name), Twitter card tags (twitter:card, twitter:title, twitter:description, twitter:image), canonical URL, lang='en' on html.\n\nMeta content per page (from brief Section 12 v2.0):\n- Homepage: 'Jodie Plant Marketing — AI-Powered Marketing for Tech Companies'\n- Services: 'Services — Jodie Plant Marketing' / 'AI-enhanced SEO, paid advertising...'\n- About: 'About — Jodie Plant Marketing' / 'Meet Jodie Plant...'\n- Results: 'Results — Jodie Plant Marketing' / 'See how Jodie Plant Marketing delivers results...'\n- Contact: 'Get Your Free Marketing Audit — Jodie Plant Marketing' / 'Get a free, personalised marketing audit...'\n\nCreate a default OG image placeholder in public/ (simple branded graphic with Cabinet Grotesk text, navy bg, orange accent).",
      "acceptanceCriteria": [
        "Every page has unique <title> and <meta name='description'> matching brief Section 12",
        "Open Graph tags (og:title, og:description, og:type, og:url, og:image) on all pages",
        "Twitter card meta tags on all pages",
        "Canonical URLs set correctly",
        "Contact page title leads with 'Get Your Free Marketing Audit' for search CTR",
        "Default OG image exists in public/",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-003", "FEAT-004", "FEAT-005", "FEAT-006", "FEAT-007"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Essential for search visibility and social sharing. The Contact page meta title ('Get Your Free Marketing Audit') is deliberately crafted for search CTR."
    },
    {
      "id": "FEAT-009",
      "title": "Add structured data, XML sitemap, and robots.txt",
      "description": "Implement structured data and search engine configuration per brief Section 12 (v2.0).\n\nStructured data (JSON-LD):\n- Organization schema: name, url, logo, contactPoint (email), sameAs (LinkedIn)\n- LocalBusiness schema (if targeting geography): name, address, email\n- Service schema on /services: serviceType for each of the 8 services\n\nXML Sitemap: Install @astrojs/sitemap, configure in astro.config.mjs with site URL https://www.jodieplant.com.\n\nrobots.txt: Create public/robots.txt, allow all crawlers, reference sitemap.\n\nClean URLs: consistent trailing slash behavior, lowercase.",
      "acceptanceCriteria": [
        "JSON-LD Organization schema in Layout or homepage",
        "Service schema markup on /services page",
        "@astrojs/sitemap installed and generates sitemap on build",
        "public/robots.txt exists with sitemap reference",
        "URLs are clean and consistent",
        "npm run build succeeds and sitemap generated in dist/"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-008"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Important for search indexing. Structured data helps with rich results."
    },
    {
      "id": "FEAT-010",
      "title": "Integrate PostHog with cookie consent banner and core event tracking",
      "description": "Install PostHog JS and build a cookie consent banner. These MUST ship together — PostHog uses cookies so consent is required before initialisation.\n\nPer brief Section 11 (v2.0):\n\nCOOKIE CONSENT BANNER (src/components/CookieConsent.astro or similar):\n- Show on first visit if no consent stored\n- Two buttons: Accept / Reject\n- On Accept: store localStorage key 'analytics_consent' = 'granted', initialise PostHog, dismiss banner\n- On Reject: store 'analytics_consent' = 'denied', dismiss banner, do NOT load PostHog\n- On page load: check localStorage — only init PostHog if consent === 'granted'\n- Include link to /privacy page\n- Consent expires after 1 year (re-prompt)\n- Banner should be non-intrusive but visible (bottom of screen, not blocking content)\n\nPOSTHOG INITIALISATION:\n- Add posthog-js via npm or CDN script\n- Initialise ONLY after consent granted\n- Use environment variable for PostHog API key and host (don't hardcode)\n- Configure: autocapture enabled, capture_pageview: true, capture_pageleave: true\n- Disable PostHog in development (check for localhost)\n\nCORE CUSTOM EVENTS (instrument across all existing pages):\n- cta_clicked: on every CTA button/link. Properties: cta_text, cta_location (hero/nav/footer/inline), cta_destination, page\n- email_clicked: on every mailto: link. Properties: location (footer/contact/inline), page\n- nav_clicked: on header/footer nav links. Properties: link_text, destination, is_mobile\n- service_card_clicked: on homepage service cards. Properties: service_name\n\nUse data-ph-* attributes or a small inline script on each interactive element. Prefer data attributes where PostHog autocapture supports them.\n\nPERSON PROPERTIES (set on first visit):\n- first_visit_page: the page they landed on\n- utm_source, utm_medium, utm_campaign: from URL params if present\n- visit_count: increment each session",
      "acceptanceCriteria": [
        "Cookie consent banner appears on first visit with Accept/Reject options",
        "PostHog JS does NOT load until user clicks Accept",
        "Rejecting consent stores preference and does not load PostHog",
        "Consent persists in localStorage across page loads (key: analytics_consent)",
        "Banner links to /privacy page",
        "PostHog initialises with autocapture, pageview, and pageleave enabled",
        "PostHog API key is configurable via environment variable, not hardcoded",
        "PostHog disabled on localhost/development",
        "cta_clicked events fire on all CTA buttons across all pages with correct properties",
        "email_clicked events fire on all mailto: links",
        "nav_clicked events fire on header and footer navigation links",
        "service_card_clicked events fire on homepage service grid",
        "UTM parameters captured as person properties from URL",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-003", "FEAT-007"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: PostHog is the analytics foundation. Cookie consent banner is legally required and MUST ship with PostHog — not deferred. Core events cover the interactions that feed into conversion funnels (FEAT-021)."
    },
    {
      "id": "FEAT-011",
      "title": "Create custom 404 page",
      "description": "Create src/pages/404.astro — branded 404 page using Layout component. Clear '404' message in bold brand tone (confident, not apologetic — e.g., 'This page doesn't exist. But your marketing strategy should.'). Links to homepage and /contact. Cabinet Grotesk headline. Orange accent on CTA.",
      "acceptanceCriteria": [
        "404.astro renders a branded 404 page with Layout (header/footer)",
        "Tone matches brand voice — confident, not apologetic",
        "Links to homepage and other key pages",
        "Uses Cabinet Grotesk headline and orange accent",
        "npm run build succeeds and 404.html generated in dist/"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "LOW-MEDIUM VALUE: Quick win for professional polish. The 404 copy is a brand opportunity — even error pages should demonstrate personality."
    },
    {
      "id": "FEAT-012",
      "title": "Add scroll animations and micro-interactions",
      "description": "Add subtle motion to the site per brief Section 7 visual style:\n- Fade-in sections on scroll (IntersectionObserver)\n- Counting-up animation for stat numbers in Social Proof bar and Results page\n- Hover effects on service cards and CTA buttons (scale, shadow, color shift)\n- Smooth scroll for anchor links\n- All animations respect prefers-reduced-motion media query\n\nKeep it subtle — enhance, don't distract. No heavy animation libraries; use CSS transitions and minimal JS.",
      "acceptanceCriteria": [
        "Sections fade in on scroll using IntersectionObserver",
        "Stat numbers animate (count up) when scrolled into view",
        "Cards and buttons have hover effects",
        "Anchor links smooth-scroll",
        "All animations disabled when prefers-reduced-motion is set",
        "No heavy animation libraries added",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": ["FEAT-003", "FEAT-006"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Motion adds polish and makes the site feel premium. Stat count-up animations draw attention to credibility numbers. Must respect accessibility."
    },
    {
      "id": "FEAT-013",
      "title": "Add blog infrastructure with 2-3 seed posts",
      "description": "Set up blog per brief Appendix C (v2.0) — this is a Phase 2 PRIORITY, not Phase 3.\n\nA marketer without a blog is like a chef without a menu. Blog content demonstrates the expertise being sold.\n\nTechnical: Use Astro Content Collections with markdown files. Create:\n- /blog listing page with featured post\n- /blog/[slug] individual post pages\n- CTA at end of each post ('Want help implementing this? Get your free audit')\n\nSeed posts (2-3 at launch):\n1. 'How to build a marketing strategy for your seed-stage startup'\n2. 'SEO vs paid ads: where should startups spend first?'\n3. 'What an AI-powered marketing workflow actually looks like'\n\nPosts should be real, substantive content (800-1500 words) that demonstrates Jodie's expertise. These are NOT placeholder posts.",
      "acceptanceCriteria": [
        "Astro Content Collections configured for blog posts",
        "/blog listing page shows posts with featured post highlighted",
        "Individual /blog/[slug] pages render markdown with clean reading experience",
        "Each post has CTA at the end linking to /contact",
        "2-3 seed posts exist with real, substantive content (800+ words each)",
        "Blog posts use brand typography and styling",
        "Navigation updated to include Blog link",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Moved from Phase 3 to Phase 2 priority. Blog posts target valuable keywords, demonstrate expertise, and give the site ongoing SEO momentum. The seed posts are carefully chosen to serve each target audience. DISTRIBUTION (per external strategy review): Blog posts should be 'LinkedIn-first' — post the substance on LinkedIn first to build entity authority signals, then link back to the site. AI models prioritize high-engagement social threads for expert citations. Each post should have a LinkedIn companion post drafted as part of the content creation process."
    },
    {
      "id": "FEAT-014",
      "title": "Add Cal.com calendar booking integration",
      "description": "Integrate Cal.com (free tier) for 15-minute intro call booking per brief Section 11 Phase 2. Add booking link/embed to /contact page 'Other Ways to Reach Me' section. Replace placeholder with working calendar link.\n\nConfigure Cal.com with:\n- 15-minute intro call slot\n- Availability windows\n- Confirmation email\n- Calendar sync",
      "acceptanceCriteria": [
        "Cal.com booking link or embed on /contact page",
        "'Book a 15-minute intro call' option available alongside form and email",
        "Booking flow works end-to-end",
        "calendar_clicked PostHog event fires when link is clicked"
      ],
      "priority": "could",
      "readyForSprint": false,
      "dependsOn": ["FEAT-007"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Third conversion path for prospects who prefer live conversation. Low effort, removes friction for call-oriented buyers."
    },
    {
      "id": "FEAT-015",
      "title": "Add live chat widget (Crisp)",
      "description": "Integrate Crisp free tier chat widget per brief Section 11 Phase 2. Widget on all pages, non-intrusive, loads async. Conversations route to Jodie. Must not cover CTAs on mobile.",
      "acceptanceCriteria": [
        "Crisp chat widget appears on all pages",
        "Widget is non-intrusive and doesn't overlap mobile CTAs",
        "Loads asynchronously without impacting page speed",
        "Chat conversations route to Jodie"
      ],
      "priority": "could",
      "readyForSprint": false,
      "dependsOn": ["FEAT-003"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Engages high-intent visitors in real-time. Phase 2 item."
    },
    {
      "id": "FEAT-016",
      "title": "Add privacy policy page covering PostHog, cookies, and GDPR",
      "description": "Create src/pages/privacy.astro. This is more important now that PostHog uses cookies.\n\nMust cover per brief Appendix C (v2.0):\n- What data is collected: PostHog analytics (page views, clicks, scroll depth), session recordings (what is/isn't captured), form submissions via Formspree\n- Cookie usage: explain PostHog session cookies, what they do, how consent works\n- How to accept/reject cookies and what happens in each case\n- How to withdraw consent after granting it\n- No data selling\n- Session recordings: explain what's recorded, data retention period, that sensitive form fields can be masked\n- GDPR compliance statement\n- Data retention policy\n- Contact for data requests: jodie@jodieplant.com\n- Right to erasure\n\nUse Layout component. Add link in Footer. Write in plain English, not legalese.",
      "acceptanceCriteria": [
        "/privacy page exists with comprehensive privacy policy",
        "Covers PostHog analytics, session recording, cookies, and form data",
        "Explains cookie consent mechanism and how to change preference",
        "Explains what session recordings capture and retention",
        "GDPR compliance section with data subject rights",
        "Written in plain English, not dense legalese",
        "Footer links to /privacy",
        "Cookie consent banner links to this page",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "ELEVATED PRIORITY: Now 'should' instead of 'could' because PostHog uses cookies. The consent banner (FEAT-010) links to this page, so it should exist before or alongside analytics go-live."
    },
    {
      "id": "FEAT-017",
      "title": "Add individual service sub-pages",
      "description": "Create 9 individual service pages per brief Appendix C (v2.0): /services/search-ai-visibility, /services/ai-marketing-systems, /services/authority-content, /services/smart-stack-paid-media, /services/social-media, /services/local-visibility, /services/email-marketing, /services/conversion-optimization, /services/growth-attribution. Each: hero, AI-enhanced approach for this service, deliverables, FAQ (3-5 questions), CTA. Targets long-tail search queries. Service names use outcome-first language per external strategy review.",
      "acceptanceCriteria": [
        "8 service sub-pages exist under /services/",
        "Each leads with the AI-enhanced approach specific to that service",
        "Each has FAQ section targeting service-specific search queries",
        "Navigation updated to support service sub-pages",
        "All pages responsive with brand styling"
      ],
      "priority": "could",
      "readyForSprint": false,
      "dependsOn": ["FEAT-005"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Good for SEO long-tail. Phase 3 — after MVP and blog are established."
    },
    {
      "id": "FEAT-018",
      "title": "Add individual case study pages (when real content exists)",
      "description": "Create /results/[slug] case study pages per brief Appendix C (v2.0). ONLY when real case study content is available — never with fabricated content. Structure: client context, strategy, execution, real metrics, testimonial, CTA. Link from /results project cards.",
      "acceptanceCriteria": [
        "Case study pages exist with real client content only",
        "Each follows structure: context, strategy, execution, results, quote, CTA",
        "Results include specific, real metrics",
        "Linked from /results page",
        "Responsive with brand styling"
      ],
      "priority": "future",
      "readyForSprint": false,
      "dependsOn": ["FEAT-006"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE when real content exists. Explicitly blocked until genuine case studies are available. Never fabricate."
    },
    {
      "id": "FEAT-019",
      "title": "Add email capture / newsletter signup with lead magnet",
      "description": "Add email capture per brief Section 11 Phase 2. Offer value exchange — downloadable 'Startup Marketing Checklist' PDF or similar. Use ConvertKit or Resend free tier. Add to blog posts and optionally homepage. Double opt-in, GDPR compliant.",
      "acceptanceCriteria": [
        "Email signup form on blog posts and/or homepage",
        "Lead magnet (checklist PDF or similar) delivered on signup",
        "Double opt-in flow",
        "Privacy notice near form",
        "Confirmation message on submission"
      ],
      "priority": "future",
      "readyForSprint": false,
      "dependsOn": ["FEAT-013"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Lead nurturing requires blog content first (FEAT-013). Phase 2 item, after blog is live."
    },
    {
      "id": "FEAT-020",
      "title": "Add PostHog contact form analytics (start, abandon, field tracking)",
      "description": "Instrument the contact/audit form with detailed PostHog event tracking per brief Section 11 'Custom Events — Contact Form'.\n\nThis goes deeper than the core CTA tracking in FEAT-010 — it tracks the full form interaction lifecycle to measure and improve form conversion.\n\nEvents to implement:\n- form_viewed: when form scrolls into viewport (IntersectionObserver)\n- form_started: when first form field receives focus. Properties: first_field\n- form_field_completed: when a field loses focus with a value. Properties: field_name\n- form_abandoned: when user navigates away with partially completed form (beforeunload). Properties: fields_completed (count), last_field\n- form_error: when validation error is shown. Properties: field_name, error_type\n\nNote: form_submitted is already tracked in FEAT-010. This story adds the surrounding lifecycle events.\n\nAlso add properties to the existing form_submitted event: budget_range (selected value), has_url (boolean), challenge_length (character count of challenge field).\n\nThis data enables calculating form completion rate (form_started vs form_submitted) and identifying where prospects drop off.",
      "acceptanceCriteria": [
        "form_viewed fires when contact form scrolls into viewport",
        "form_started fires on first field focus with first_field property",
        "form_field_completed fires on blur for each field with field_name",
        "form_abandoned fires on page leave with partial form data (fields_completed, last_field)",
        "form_error fires on validation errors with field_name and error_type",
        "form_submitted event enriched with budget_range, has_url, challenge_length properties",
        "Events only fire when PostHog consent is granted",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-010"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: The form is the primary conversion path. Understanding where prospects drop off (which field, at what stage) directly enables conversion optimization. Form completion rate is a Section 13 KPI."
    },
    {
      "id": "FEAT-021",
      "title": "Add PostHog scroll depth and section visibility tracking",
      "description": "Add scroll and content engagement tracking per brief Section 11 'Custom Events — Page-Level'.\n\nEvents to implement:\n- scroll_depth: fires when user scrolls past 25%, 50%, 75%, 100% of page. Properties: depth_percent, page. Use IntersectionObserver on sentinel elements at each threshold. Deduplicate — each threshold fires once per page load.\n- page_section_viewed: fires when a named section scrolls into viewport. Properties: section_id, page, viewport_percent. Track all major sections on homepage (hero, social-proof, differentiators, services, final-cta) and other pages.\n\nThis data answers: 'How far do visitors scroll?', 'Do they see the services section?', 'Does anyone reach the final CTA?'\n\nAll events conditional on PostHog consent being granted.",
      "acceptanceCriteria": [
        "scroll_depth events fire at 25%, 50%, 75%, 100% thresholds with deduplication",
        "page_section_viewed fires for all major homepage sections and key sections on other pages",
        "Events include page and section_id properties",
        "IntersectionObserver used (no scroll event listeners)",
        "Events only fire when PostHog consent is granted",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-010"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Scroll depth reveals whether the condensed 5-section homepage is working. If visitors aren't reaching the final CTA, the page needs restructuring. Section visibility data validates the design decisions."
    },
    {
      "id": "FEAT-022",
      "title": "Configure PostHog conversion funnels and dashboards",
      "description": "Set up PostHog dashboards and funnels per brief Section 11 'Conversion Funnels' and 'PostHog Dashboards'. This is configuration in the PostHog UI, not code — but document the setup in a new docs/ANALYTICS_SETUP.md file so it can be recreated.\n\nFUNNELS to configure:\n1. Primary funnel: $pageview (/) → $pageview (/contact) → form_started → form_submitted\n2. Services exploration: $pageview (/) → service_card_clicked OR $pageview (/services) → $pageview (/contact) → form_submitted\n\nDASHBOARDS to configure:\n1. Overview: unique visitors (daily/weekly/monthly), page views by page, bounce rate, avg session duration, top referrers, device breakdown\n2. Conversion: primary funnel visualization, form submissions (daily trend), email clicks, CTA clicks by location, form completion rate (started vs submitted), form abandonment by last field\n\nCreate docs/ANALYTICS_SETUP.md documenting:\n- PostHog project setup steps\n- Each funnel definition (steps, filters)\n- Each dashboard panel definition\n- How to read the key metrics\n- Mapping to brief Section 13 KPIs",
      "acceptanceCriteria": [
        "docs/ANALYTICS_SETUP.md created with full PostHog configuration guide",
        "Document defines primary and services exploration funnels with exact event filters",
        "Document defines Overview and Conversion dashboard panels",
        "Each KPI from brief Section 13 is mapped to a specific PostHog metric or dashboard panel",
        "Setup is reproducible from the documentation alone"
      ],
      "priority": "should",
      "readyForSprint": true,
      "dependsOn": ["FEAT-020", "FEAT-021"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Without configured funnels and dashboards, raw events are just noise. This turns PostHog data into actionable insights. Documentation ensures the setup is reproducible."
    },
    {
      "id": "FEAT-023",
      "title": "Enable PostHog session recording with privacy controls",
      "description": "Enable PostHog session recording per brief Section 11. Session recordings let Jodie watch how visitors interact with the site — where they hover, scroll, click, and get stuck.\n\nConfiguration:\n- Enable session recording in PostHog init config (only when consent granted)\n- Mask sensitive form fields: budget_range dropdown value, company URL. Use PostHog's data attribute (data-ph-no-capture) on sensitive elements\n- Set recording sample rate (start at 100% — low traffic site, free tier allows 5K/month)\n- Document in ANALYTICS_SETUP.md: what's recorded, what's masked, retention period, how to review recordings\n\nPrivacy:\n- Recordings only captured when cookie consent is granted\n- Sensitive form field values masked\n- Update /privacy page content if it exists (FEAT-016) to explain session recordings",
      "acceptanceCriteria": [
        "PostHog session recording enabled in init config",
        "Recordings only captured when analytics consent is granted",
        "Sensitive form fields have data-ph-no-capture attribute",
        "Session recording documented in docs/ANALYTICS_SETUP.md",
        "If /privacy page exists, it explains what session recordings capture",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": ["FEAT-010"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Session recordings are invaluable for understanding why visitors don't convert. At low traffic volumes, watching individual sessions is often more useful than aggregate data. Free tier supports 5K recordings/month."
    },
    {
      "id": "FEAT-024",
      "title": "Add PostHog blog content engagement tracking",
      "description": "When blog exists (FEAT-013), add content-specific PostHog events per brief Section 11 'Custom Events — Content Engagement'.\n\nEvents:\n- blog_post_read: fires when user scrolls past 75% of post body. Properties: post_slug, post_title, read_time_seconds (time from page load to 75% scroll)\n- external_link_clicked: fires on any outbound link click from blog posts. Properties: url, link_text, page\n\nAlso add blog CTA tracking — when the end-of-post 'Get your free audit' CTA is clicked, fire cta_clicked with cta_location = 'blog_post' and post_slug.\n\nThis data feeds the Content funnel defined in brief Section 11 and the Phase 2 Content Dashboard.",
      "acceptanceCriteria": [
        "blog_post_read fires at 75% scroll of post body with slug, title, and read_time",
        "external_link_clicked fires on outbound links in blog posts",
        "Blog CTA clicks tracked as cta_clicked with cta_location='blog_post'",
        "Events only fire when PostHog consent is granted",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": false,
      "dependsOn": ["FEAT-010", "FEAT-013"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Measures whether blog content drives enquiries. Blocked on blog existing (FEAT-013). Feeds the Content Dashboard and content funnel."
    },
    {
      "id": "FEAT-026",
      "title": "Create GEO-optimized 'best answer' content pages",
      "description": "Create 3-5 'best answer' content pages designed to win in AI answer engines and human search. These pages directly and completely answer high-intent buyer questions.\n\nRef: MARKET_RESEARCH_2026.md 'Content Designed for AI Answers', WEBSITE_BRIEF.md Appendix A 'Best Answer Content Pages'.\n\nPriority pages:\n1. 'How much does startup marketing cost?' — pricing transparency, budget tiers from research, what to expect at each level. Demystifies costs, builds trust.\n2. 'Marketing agency vs freelancer vs in-house' — comparison table using Section 6 data. Honest pros/cons of each.\n3. 'What does a marketing retainer actually include?' — concrete deliverables, typical month walkthrough.\n4. 'How to get leads without expensive Google and Meta Ads' — alternative channels from research (partnerships, newsletters, community, LinkedIn organic).\n5. 'What is GEO and why does it matter for your business?' — thought leadership, demonstrates expertise.\n6. 'Fractional CMO vs Marketing Agency vs Freelancer vs In-House' — comparison using Section 6 data plus fractional CMO pricing (see FEAT-039 for full spec).\n\nFormat for each page:\n- Clear question as H1 headline\n- Direct, concise answer in the first paragraph (AI-extractable)\n- Supporting detail, examples, and evidence\n- Structured data (FAQPage schema where applicable)\n- CTA: 'Want help with this? Get your free marketing audit'\n- Author attribution (Jodie Plant) for E-E-A-T signals\n\nThese can be blog posts (if blog infrastructure exists via FEAT-013) or standalone pages under a /guides or /resources path.",
      "acceptanceCriteria": [
        "At least 3 'best answer' pages published with substantive content (800+ words each)",
        "Each page has a clear question as headline and direct answer in opening paragraph",
        "FAQPage structured data on pages with FAQ-style content",
        "Each page has CTA linking to /contact for free audit",
        "Content is genuinely useful and demonstrates expertise (not thin SEO content)",
        "Pages are linked from relevant service pages and/or navigation",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Core GEO/AEO strategy. These pages serve both AI citation (direct answers, structured data) and human conversion (trust-building, CTA). The pricing transparency page alone can be a significant lead driver. Can launch as standalone pages even before blog infrastructure."
    },
    {
      "id": "FEAT-027",
      "title": "Add llms.txt for AI agent discoverability",
      "description": "Create public/llms.txt — a curated, AI-friendly index of the site's most important content in clean markdown format.\n\nRef: MARKET_RESEARCH_2026.md 'llms.txt', WEBSITE_BRIEF.md Section 10 'AI Discoverability'.\n\nllms.txt is a proposed convention for helping AI agents understand a site's key content. It should:\n- List key pages with brief descriptions\n- Use clean markdown format\n- Include: homepage, services, about, results, contact\n- Include blog posts and 'best answer' pages when they exist\n- Optionally create llms-full.txt with extended page content\n\nFormat example:\n```\n# Jodie Plant Marketing\n\n> AI-powered digital marketing for startups and tech companies.\n\n## Pages\n\n- [Homepage](https://www.jodieplant.com/): Full-service digital marketing for tech companies, powered by AI.\n- [Services](https://www.jodieplant.com/services): AI-enhanced SEO, paid ads, content, social, email, analytics + outcome-based packages.\n- [About](https://www.jodieplant.com/about): Jodie Plant — senior marketer, AI-enhanced workflows, no agency bloat.\n- [Results](https://www.jodieplant.com/results): Methodology, credentials, and what to expect from an engagement.\n- [Contact](https://www.jodieplant.com/contact): Free marketing audit, contact form, booking.\n```\n\nThis is a small technical add-on — not a substitute for authority or distribution. Treat as one component of the broader GEO strategy.",
      "acceptanceCriteria": [
        "public/llms.txt exists with curated site index in clean markdown",
        "All MVP pages listed with accurate descriptions",
        "File is accessible at /llms.txt on the live site",
        "Format follows the llms.txt convention (markdown, concise descriptions)",
        "npm run build succeeds"
      ],
      "priority": "could",
      "readyForSprint": true,
      "dependsOn": ["FEAT-003", "FEAT-004", "FEAT-005", "FEAT-006", "FEAT-007"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "LOW VALUE: Quick win but tempered expectations — Google confirmed they don't use llms.txt and no major AI company has officially adopted it. Useful for developer docs and RAG systems. Implementation cost is minimal (future-proofing), but don't prioritize over schema markup, entity authority, or content quality."
    },
    {
      "id": "FEAT-029",
      "title": "Add FAQ structured data to service and content pages",
      "description": "Add FAQPage JSON-LD structured data to pages that contain FAQ-style content. This supports both traditional search rich results and AI answer engine discoverability.\n\nRef: MARKET_RESEARCH_2026.md 'Content Designed for AI Answers', WEBSITE_BRIEF.md Section 12 'GEO / Answer Engine Optimization'.\n\nPages to add FAQ schema:\n- /services — common questions about engagement models, pricing, what's included\n- /results — questions about methodology, what to expect, timelines\n- 'Best answer' content pages (FEAT-026) — inherently FAQ-structured\n- Individual service sub-pages (FEAT-017) when they exist — 3-5 FAQs per service\n\nImplementation:\n- Create a reusable FAQSchema.astro component that accepts an array of {question, answer} objects\n- Render as JSON-LD in the page <head>\n- Also render the FAQ content visibly on the page (accordion or list) — structured data must match visible content\n- Validate with Google's Rich Results Test",
      "acceptanceCriteria": [
        "FAQSchema.astro component exists and is reusable across pages",
        "FAQPage JSON-LD renders in <head> with valid schema",
        "FAQ content is visible on the page (not hidden)",
        "Schema validates with Google Rich Results Test",
        "/services page has at least 3-5 FAQs with structured data",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-005", "FEAT-009"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: FAQ structured data is a direct GEO/AEO tactic — helps both Google rich results and AI answer extraction. Reusable component makes it easy to add FAQs to any page. Low effort, compounding benefit."
    },
    {
      "id": "FEAT-031",
      "title": "Create 'Alternatives to Google & Meta Ads' best-answer content page",
      "description": "Create a GEO-optimized 'best answer' content page: 'How to Get Leads Without Expensive Google and Meta Ads.'\n\nRef: MARKET_RESEARCH_2026.md Part 3 — detailed platform comparison with CPCs, minimum budgets, and smart stack allocations.\n\nThis page should cover:\n- Why Google/Meta CPCs keep climbing and what that means for SMBs\n- Platform alternatives with specific data: Bing (~60% lower CPC), Reddit (~$0.20), Quora ($0.35-$0.75), TikTok Spark Ads, Pinterest\n- Organic/owned alternatives: micro-influencer partnerships ($100-$500/post), newsletter sponsorships ($200-$1,000), podcast advertising, LinkedIn organic, community marketing\n- Smart stack budget allocations ($2K, $3K, $5K monthly breakdowns)\n- The 'rent vs own' argument (paid stops when you stop paying; content compounds)\n\nFormat: Clear question headline, direct answer first paragraph, supporting detail with data tables, CTA to free marketing audit.\n\nThis page is both a lead magnet (genuinely useful to the target audience) and a GEO play (AI systems will cite specific budget data and platform comparisons).",
      "acceptanceCriteria": [
        "Page published with 1000+ words of substantive content",
        "Includes specific CPC data and minimum budgets for each platform",
        "Includes smart stack budget allocation tables",
        "Has clear question headline and direct answer in opening paragraph",
        "Includes CTA to /contact for free audit",
        "FAQPage structured data if applicable",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: This page directly serves the #1 question budget-conscious buyers ask. The specific data (CPCs, budget allocations) makes it citation-worthy for AI systems. Also positions Jodie as a 'smart budget' expert, not just another Google Ads reseller."
    },
    {
      "id": "FEAT-032",
      "title": "Add AI Visibility Audit as primary bridge product on /services and /contact",
      "description": "Add the 'AI Visibility Audit' as the PRIMARY BRIDGE PRODUCT prominently on /services and /contact pages. This is the key conversion ladder element that closes the trust gap between the free audit and retainer commitment (see brief Section 4 'Closing the Trust Gap').\n\nRef: MARKET_RESEARCH_2026.md Part 4 — one-time project fee $500-$1,500.\n\nSTRATEGIC ROLE: The jump from Free Audit ($0) to Growth Retainer ($2,500+) is a significant trust gap. Founders are wary of free audits being generic sales pitches. The AI Visibility Audit transforms Jodie from 'vendor asking for a retainer' into 'consultant providing a paid diagnostic.' It's much easier to sell a $4K/month retainer once they've already paid $1K for a high-value insight report.\n\nThe AI Visibility Audit asks: 'What happens when someone asks ChatGPT/Perplexity/Gemini about your industry? Are you cited? Are competitors? What would it take to change that?'\n\nConversion ladder: Free Audit → AI Visibility Audit ($500-$1,500) → Retainer ($1,500-$7,500/mo)\n\nImplementation:\n- Add audit as a PROMINENT section on /services page — not buried in a pricing table. It's the recommended first paid engagement.\n- Add as a visually distinct upsell section on /contact page: 'Want a Deeper Dive? Book an AI Visibility Audit' — separate card/block from the free audit form with clear pricing.\n- Consider a dedicated landing page for the audit (could be a best-answer page).\n\nDeliverables to describe:\n- Audit of how the brand appears across ChatGPT, Perplexity, Gemini, Google AI Overviews\n- Competitor AI visibility comparison\n- Content gap analysis (what questions are being asked that you don't answer?)\n- Entity authority assessment\n- Actionable recommendations with priority ranking",
      "acceptanceCriteria": [
        "AI Visibility Audit has a prominent, dedicated section on /services page (not just a row in a pricing table)",
        "AI Visibility Audit has a visually distinct upsell section on /contact page with clear pricing",
        "Clear conversion ladder messaging: Free Audit → AI Visibility Audit → Retainer",
        "Pricing clearly stated ($500-$1,500)",
        "Clear differentiation from the free marketing audit (paid diagnostic vs. free assessment)",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": false,
      "dependsOn": ["FEAT-005", "FEAT-007"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "ELEVATED TO MUST: Primary bridge product closing the trust gap (per external strategy review). The conversion ladder (Free Audit → Paid Diagnostic → Retainer) is a proven consultative sales pattern. Must be prominently featured, not buried. Ship alongside or immediately after MVP."
    },
    {
      "id": "FEAT-033",
      "title": "Add pricing FAQ section with structured data to services page",
      "description": "Add a FAQ section below the pricing cards on /services addressing common pricing questions. The pricing cards themselves (Foundation/Growth/Authority tiers) are built as part of FEAT-005. This item adds the supporting FAQ content and structured data.\n\nQuestions to answer:\n- 'How much does startup marketing cost?'\n- 'What's included in a retainer?'\n- 'Can I start with a one-time project?'\n- 'What if I need something custom?'\n- 'How long until I see results?'\n\nImplementation:\n- FAQ content visible as accordion or list below pricing cards\n- FAQPage JSON-LD structured data (reuse component from FEAT-029 if available)\n- This is a GEO play — pricing FAQs are high-intent queries that AI systems frequently answer",
      "acceptanceCriteria": [
        "FAQ section exists below pricing cards with 4-5 common pricing questions",
        "FAQPage structured data renders in page head",
        "FAQ content matches the tiered pricing structure from FEAT-005",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-005"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Pricing FAQs are a GEO opportunity — 'how much does marketing cost' is a high-intent query. Structured data helps with both Google rich results and AI answer extraction. Depends on pricing cards being built in FEAT-005."
    },
    {
      "id": "FEAT-035",
      "title": "Build entity authority presence for Jodie Plant Marketing",
      "description": "Build consistent brand presence across the web to improve AI citation confidence. This is NOT a code/website task — it's an off-site authority building task that should be tracked alongside website work.\n\nRef: MARKET_RESEARCH_2026.md Part 2 — entity authority matters more than keyword volume for GEO. If a brand appears across multiple credible sources, AI systems gain confidence in recommending it.\n\nCRITICAL INSIGHT: For a GEO-led strategy, LinkedIn is the 'Home Page' for AI crawlers. AI models (Perplexity, Gemini) prioritize high-engagement social threads when looking for 'expert' citations. This makes LinkedIn the #1 entity authority channel.\n\nActions:\n- Create/optimize LinkedIn profile and company page with consistent positioning\n- LINKEDIN-FIRST CONTENT DISTRIBUTION: Post substantive content on LinkedIn first to build entity signals and engagement, then link back to the site. The LinkedIn thread IS the primary distribution — high-engagement posts create the entity authority signals AI systems use for citations. Every blog post should have a LinkedIn companion post drafted as part of content creation.\n- Register on relevant directories (Clutch, DesignRush, GoodFirms, etc.)\n- Establish presence on Reddit (r/marketing, r/startups, r/smallbusiness) with genuine value\n- Set up Google Business Profile if targeting local clients\n- Ensure NAP (name, address, phone) consistency across all listings\n- Begin collecting reviews/testimonials on Google and LinkedIn\n- Contribute to industry forums and communities\n\nGoal: When someone asks ChatGPT/Perplexity 'who are good marketing consultants for startups?', Jodie Plant Marketing should start appearing as a recommendation.",
      "acceptanceCriteria": [
        "LinkedIn personal and company profiles optimized with consistent brand positioning",
        "Listed on at least 3 relevant agency directories",
        "Active presence on at least 2 community platforms (Reddit, forums, etc.)",
        "Google Business Profile created if targeting local",
        "NAP consistency verified across all listings",
        "At least 1 review or testimonial collected"
      ],
      "priority": "must",
      "readyForSprint": true,
      "groomedAt": "2026-02-23",
      "groomingNotes": "ELEVATED TO MUST: Off-site authority is the #1 lever for AI citation, confirmed by 2026 market research. No dependencies on website code. Start immediately in parallel with website development. This is the 'practice what you preach' item for GEO. CRITICAL (per external strategy review): LinkedIn is the 'Home Page' for AI crawlers — adopt LinkedIn-first content distribution. Post substance on LinkedIn to build entity signals, then link back to site. AI models prioritize high-engagement social threads for expert citations. Jodie should be actively contributing on Reddit (r/marketing, r/startups), LinkedIn, and at least one directory within 30 days of launch."
    },
    {
      "id": "FEAT-036",
      "title": "Add Fractional Marketing Leadership as a service and positioning element",
      "description": "Add 'Fractional Marketing Leadership' language throughout the site to capture the fractional CMO buyer segment.\n\nThis is NOT a new service — it's a reframing of what the Authority tier already delivers. But the term 'fractional CMO' is a recognized buying category that founders actively search for.\n\nImplementation:\n- Add as the 5th hero service card on the homepage\n- Add as a service block on /services (positioned after Paid Advertising)\n- Add to About page positioning statement\n- Add to Authority tier package description: 'Fractional marketing leadership — strategy, execution, and reporting at the CMO level'\n- Add fractional CMO keywords to SEO meta tags and page content\n- Authority tier pricing card can be labeled 'Fractional CMO' or 'Fractional Marketing Leadership'\n\nKey messaging:\n- 'Think of me as your fractional CMO — senior marketing leadership without the $300K salary'\n- 'Strategy AND execution. Not a consultant who leaves you with a PDF'\n- 'Embedded in your team, not an outside vendor'\n\nDo NOT:\n- Create a separate pricing tier — this IS the Authority tier, just named differently\n- Overclaim — fractional CMO implies strategic leadership, not just task execution\n- Use 'fractional CMO' on the Foundation or Growth tiers — those are execution-focused, not leadership-focused",
      "acceptanceCriteria": [
        "Fractional Marketing Leadership appears as a homepage hero service card",
        "Fractional Marketing Leadership has a service block on /services",
        "Authority tier description includes 'fractional marketing leadership' language",
        "About page positioning statement references fractional CMO model",
        "SEO meta tags include fractional CMO keywords on relevant pages",
        "npm run build succeeds"
      ],
      "priority": "must",
      "readyForSprint": true,
      "dependsOn": ["FEAT-003", "FEAT-004", "FEAT-005"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE, LOW EFFORT: The single highest-impact positioning change identified in the marketing review. Jodie already delivers this service — the brief just doesn't name it. Adding the language opens the fractional CMO buyer category without restructuring anything."
    },
    {
      "id": "FEAT-037",
      "title": "Add Conversion Rate Optimization (CRO) to services and Growth/Authority tiers",
      "description": "Add CRO as a service block on /services and as an explicit deliverable in Growth and Authority retainer tiers.\n\nCRO is a high-ROI service that's notably absent from the current brief. For tech companies spending on traffic (paid or organic), optimizing conversion rates is often the highest-leverage activity.\n\nService block content:\n- The AI difference: AI-powered A/B test prioritization, heatmap analysis, conversion funnel optimization\n- Deliverables: Conversion audit, A/B testing, landing page optimization, form/CTA optimization, funnel analysis, monthly reporting\n- Client benefit: 'A 20% improvement in conversion rate equals a 20% increase in your marketing budget — without spending another dollar on ads.'\n\nPackage integration:\n- Growth tier: Add 'landing page optimization and basic conversion tracking'\n- Authority tier: Add 'full CRO program including A/B testing and funnel optimization'\n- One-time: 'Conversion & Tracking Setup' already exists ($1,000-$3,000) — expand description to include CRO audit",
      "acceptanceCriteria": [
        "CRO service block exists on /services page with AI difference, deliverables, and client benefit",
        "Growth tier explicitly mentions conversion optimization",
        "Authority tier explicitly mentions CRO program",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-005"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: CRO pairs naturally with paid advertising and SEO. Adding it as a deliverable in Growth/Authority tiers increases perceived value of those packages. Service block on /services provides a long-tail SEO target."
    },
    {
      "id": "FEAT-038",
      "title": "Add Go-To-Market (GTM) Strategy Sprint as a productized one-time offering",
      "description": "Add a 'GTM Strategy Sprint' as a one-time project option ($3,000-$7,000) on /services and /contact pages.\n\nFor funded startups preparing a product launch, market entry, or pivot. This captures founders who have an imminent need but aren't ready for a monthly retainer.\n\nDeliverables:\n- Market positioning and competitive analysis\n- Channel strategy and prioritization\n- Messaging framework and value proposition\n- 90-day marketing execution roadmap\n- Budget allocation recommendations\n- Recommended tech stack\n\nPositioning:\n- Entry point for startups that just raised a round\n- Natural upsell path into ongoing retainer work\n- Demonstrates strategic depth before monthly commitment\n\nImplementation:\n- Add to one-time projects table on /services pricing section\n- Add as option on /contact page: 'Planning a launch? Ask about our GTM Strategy Sprint'\n- Can be paired with the free marketing audit as a deeper engagement",
      "acceptanceCriteria": [
        "GTM Strategy Sprint listed in one-time projects on /services with price range",
        "Deliverables clearly described",
        "Mentioned or linked from /contact page",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-005", "FEAT-007"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "MEDIUM VALUE: Fills a gap between free audit and monthly retainer. GTM is a recognized buying category for funded startups. $3K-$7K is an accessible entry point that demonstrates value before committing to $2.5K-$7.5K/month."
    },
    {
      "id": "FEAT-039",
      "title": "Create 'Fractional CMO vs Agency vs In-House' best-answer content page",
      "description": "Create a GEO-optimized best-answer page: 'Fractional CMO vs Marketing Agency vs In-House: Which Is Right for Your Startup?'\n\nThis is one of the highest-intent comparison queries in the marketing services space. It naturally positions Jodie's service model as the answer.\n\nContent should cover:\n- What each model actually looks like (fractional CMO, agency, freelancer, in-house hire)\n- Honest comparison table: cost, quality, speed, accountability, strategic depth\n- When each model is the right fit (stage, budget, needs)\n- The hidden costs of each model (agency overhead, hiring time, management burden)\n- Real pricing data from the market ($5K-$15K/month fractional vs $200K-$400K full-time vs $6K-$60K agency retainer)\n- Use competitive comparison data from brief Section 6\n\nFormat: Clear comparison headline, direct answer in first paragraph, detailed comparison table, pricing breakdown, FAQ section with structured data, CTA to free audit.\n\nThis page serves dual purpose:\n1. GEO target — AI systems frequently answer 'should I hire a fractional CMO?' queries\n2. Sales enablement — sends this page to prospects evaluating their options",
      "acceptanceCriteria": [
        "Page published with 1000+ words of substantive comparison content",
        "Includes honest comparison table across all models",
        "Includes real pricing data for each model",
        "Has clear question headline and direct answer in opening paragraph",
        "FAQPage structured data",
        "CTA to /contact for free audit",
        "npm run build succeeds"
      ],
      "priority": "should",
      "readyForSprint": false,
      "dependsOn": ["FEAT-002"],
      "groomedAt": "2026-02-23",
      "groomingNotes": "HIGH VALUE: Fractional CMO comparison queries are high-intent and growing. This page positions Jodie in the conversation and uses real market pricing data (from the review) to build credibility. Natural fit alongside the other best-answer pages in FEAT-026."
    }
  ],
  "_dependsOn_docs": "Items may include an optional 'dependsOn' array of item ID strings (e.g. \"dependsOn\": [\"FEAT-001\"]). Auto-pick skips items whose dependencies are not yet done."
}
